img/app/controllers/images_controller.rb

SELECT "images".* FROM "images"
SELECT "image_users".* FROM "image_users" WHERE "image_users"."user_id" = ?  [["user_id", 1]]
SELECT "images".* FROM "images" WHERE "images"."user_id" = ?  [["user_id", 1]]
---
  def index
    @images = Image.all
    @public_images = []
    @images.each do |image|
      if !image.private
	@public_images << image
      end
    end
    if user_signed_in?
      @my_images = current_user.images
      @images_shared_with_me = current_user.image_users.map {|image_user| image_user.image}

SELECT "image_users".* FROM "image_users" WHERE "image_users"."image_id" = ?  [["image_id", 71]]
SELECT "tags".* FROM "tags" WHERE "tags"."image_id" = ?  [["image_id", 71]]
SELECT "users".* FROM "users" INNER JOIN "image_users" ON "users"."id" = "image_users"."user_id" WHERE "image_users"."image_id" = ?  [["image_id", 71]]
---
  def show
    @image_tags = @image.tags
    @tag = @image.tags.new
    @image_user = @image.image_users.new
    if current_user != nil && @image.user_id == current_user.id
      # let user see page since they own it
    elsif @image.private && current_user == nil
      # image is private and user is not signed in so they dont have access
      redirect_to images_path, notice: 'You Do Not Have Access To That Image'
    elsif @image.private && @image.image_users.map {|x| x.user_id}.index(current_user.id) == nil

INSERT INTO "images" ("private", "filename", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["private", "f"], ["filename", "a3df5bcf.jpg"], ["user_id", 27], ["created_at", "2016-06-30 02:05:08.596809"], ["updated_at", "2016-06-30 02:05:08.596809"]]
---
  def create
      @image = Image.new(image_params)
      @image.filename = "#{SecureRandom.hex(4)}.jpg"
      #@image.generate_filename  # a function you write to generate a random filename and put it in the images "filename" variable
      @image.user = current_user

      @uploaded_io = params[:image][:uploaded_file]

      File.open(Rails.root.join('public', 'images', @image.filename), 'wb') do |file|
	file.write(@uploaded_io.read)
      end

    if @image.save

UPDATE "images" SET "private" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["private", "f"], ["updated_at", "2016-06-30 01:34:32.235195"], ["id", 208]]
---
  def update
      if @image.update(image_params)