img/app/controllers/image_users_controller.rb

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "image_users" ("user_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["image_id", 7], ["created_at", "2016-06-30 01:31:59.868638"], ["updated_at", "2016-06-30 01:31:59.868638"]]
---
  def create
    @image = Image.find params[:image_id]
    @image_user = @image.image_users.new(image_user_params)
    if @image_user.save

DELETE FROM "image_users" WHERE "image_users"."id" = ?  [["id", 422]]
---
  def destroy
    @image_user.destroy

SELECT  "image_users".* FROM "image_users" WHERE "image_users"."id" = ? LIMIT 1  [["id", 422]]
---
    def set_image_user
      @image_user = ImageUser.find(params[:id])