img/app/controllers/tags_controller.rb

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 209]]
INSERT INTO "tags" ("str", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["str", "Raindeer"], ["image_id", 209], ["created_at", "2016-06-30 02:05:27.628636"], ["updated_at", "2016-06-30 02:05:27.628636"]]
---
  def create
    @image = Image.find params[:image_id]
    @tag = @image.tags.new(tag_params)
    respond_to do |format|
      if @tag.save