img/app/views/image_users/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user_id %><br>
    <%= f.select :user_id, @image.eligible_users %>