img/app/views/images/show.html.erb

	  <tbody id="user_box">
	    <% @image.image_users.each do |image_user| %>
---
SELECT "image_users".* FROM "image_users" WHERE "image_users"."image_id" = ?  [["image_id", 14]]

    <tbody>
      <% @image.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."image_id" = ?  [["image_id", 71]]